In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('IITK_Courses_Report.csv')

In [3]:
print(df)

         Student Name  Course  Marks (%)  Attendance (%)
0         Dipon Konar  ELC111      56.72           63.08
1      Parth Parashar  PHY113      84.59           20.96
2         Anurag Sahu  MTH113      41.13           59.86
3    Hemakshi Kumawat  CHM112      59.43           57.34
4      Parth Parashar  ELC111      62.88           30.82
..                ...     ...        ...             ...
195     Kritika Singh  ELC112      68.57           77.98
196   Harshit Karnani  PHY112      52.31           35.75
197       Sneha Patra  PHY113      58.98           21.98
198       Ashma Singh  PHY111      88.56           82.63
199    Parth Parashar  PHY115      80.52           42.89

[200 rows x 4 columns]

In [4]:
df.dropna(subset=['Student Name'])
df.dropna(subset=['Course'])

         Student Name  Course  Marks (%)  Attendance (%)
0         Dipon Konar  ELC111      56.72           63.08
1      Parth Parashar  PHY113      84.59           20.96
2         Anurag Sahu  MTH113      41.13           59.86
3    Hemakshi Kumawat  CHM112      59.43           57.34
4      Parth Parashar  ELC111      62.88           30.82
..                ...     ...        ...             ...
195     Kritika Singh  ELC112      68.57           77.98
196   Harshit Karnani  PHY112      52.31           35.75
197       Sneha Patra  PHY113      58.98           21.98
198       Ashma Singh  PHY111      88.56           82.63
199    Parth Parashar  PHY115      80.52           42.89

[197 rows x 4 columns]

In [5]:
def geometric_mean(x, y):
    return np.sqrt(x * y)
for column in df.select_dtypes(include=[np.number]).columns:
    for i in range(1, len(df) - 1):
        if pd.isnull(df.loc[i, column]):
            above = df.loc[i - 1, column]
            below = df.loc[i + 1, column]
            if not pd.isnull(above) and not pd.isnull(below):
                df.loc[i, column] = geometric_mean(above, below)

df.to_csv('cleaned_IITK_Courses_Report.csv.')